<template lang="pug">
section#section-greeting
  base-greeting(:title="title" :filename="filename" :content="content")
</template>

<script>
export default {
  name: 'SectionGreeting',
  components: {
    BaseGreeting: () => import('../../../components/base/BaseGreeting.vue')
  },
  data () {
    return {
      title: '정보콘텐츠학과 홈페이지를 방문해주셔서 감사합니다.',
      filename: 'greeting.jpg',
      content: `오늘날의 정보화 사회에서는 컴퓨터를 이용해 정보를 처리하는 정보기술에 대한 중요성이 매우 크게 대두되고 있습니다. 이에 발맞추어 광운대학교가 1971년 전자계산학과로 개설되어 현재 소프트웨어학부까지 컴퓨터 소프트웨어 관련 학문을 연구하는 요람이 되어왔습니다.

특히 2003학년도부터 현재의 교과과정에 최근 산업체의 수요 및 요구를 반영하여 게임, 보안, 네트워크의 심화 전공 트랙을 개설하여 3학년 2학기부터 심화과정을 이수할 수 있도록 하고 있습니다. 또한 정보기술(Information Technology) 전문 지식과 최신 실용 기술을 교육함으로써 정보화 시대의 우수한 IT 전문 인력 양성을 목표로 1980년에 대학원 과정을 개설하여 컴퓨터과학 전공의 석사 및 박사를 배출하고 있습니다.
소프트웨어학부는 11명의 훌륭한 교수진으로 운영되고 있으며 학부생들의 컴퓨터 소프트웨어 및 응용 실험을 위하여 2개의 전용 실습실과 모션캡쳐, VR 실험 등을 위한 다수의 공동 실습실을 보유하고 있습니다. 또한 델 서버를 비롯하여 다수의 Workstation과 PC들을 구비하여 학생들의 소프트웨어 실습을 지원하고 있으며, iOS 계열의 소프트웨어 개발을 지원하기 위하여 맥북프로 및 아이패드를 대여하고 있습니다.
2002년 3월부터 운영되고 있는 공학인증 프로그램은 산업체에서 실무를 수행할 수 있는 유능한 소프트웨어 엔지니어를 양성하기 위하여, 실무 기초 핵심 분야의 집중 교육 강화와 최근 산업체 수요가 많은 분야들에 대한 심화전공 교과 과정 개설을 주된 내용으로 하고 있습니다. 우선 소프트웨어 실무 기초 핵심 분야 교과 과정은, 소프트웨어 엔지니어의 기본적인 소양과 기초과학에 대한 교육을 대폭 강화하고, 이를 바탕으로 어떤 분야의 소프트웨어 시스템이라도 능숙히 구축할 수 있도록 하고 있습니다. 이를 위해서 현재 상용시스템 개발에 가장 널리 사용되고 있는 프로그래밍 언어들과 상용 개발 도구들에 대한 집중적인 실습 교육을 행하고, 또한 많은 소프트웨어 시스템에 이용되고 있는 상용 데이터베이스와 네트워크 시스템들을 능숙하게 활용할 수 있는 실무 능력을 배양하는 것을 중점 사항으로 하고 있습니다.
졸업생은 국내·외 관련 사업계, 학계에 주로 진출하고 있으며 새로운 아이디어로 벤처 창업에 성공한 경우도 있습니다.
교육은 강의, 실습, 프로젝트, 세미나, 합동연구와 같은 다양한 방법으로 진행되며 새로운 지식을 창조할 수 있는 미래와 기술 지도자를 양성하는 데에 초점을 맞추고 있습니다. 소프트웨어학부에서는 여러분들의 적극적인 지원과 참여를 기다리고 있습니다.

감사합니다.`
    }
  }
}
</script>

<style>

</style>
